In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings("ignore")
from sklearn.model_selection import train_test_split
pd.set_option("display.max_columns",100)

In [2]:
event_type=pd.read_csv('event_type.csv')
event_type.sample(5)

          id     event_type
869     1126  event_type 15
23725   9753  event_type 23
3228   15808  event_type 13
15342  18163  event_type 34
8552    2192  event_type 34

In [3]:
event_type.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31170 entries, 0 to 31169
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          31170 non-null  int64
 1   event_type  31170 non-null  object
dtypes: int64(1), object(1)
memory usage: 487.2+ KB

In [4]:
event_type['event_type'].replace('[^0-9.]','',inplace=True,regex=True)
event_type.sample(4)

          id event_type
13678  17698         34
947    14557         15
14228   4500         34
11807   4016         34

In [5]:
log_feature=pd.read_csv('log_feature.csv')

In [6]:
log_feature.sample(5)

          id  log_feature  volume
53269   8590  feature 376       9
51607   2363  feature 195       3
26716  17157  feature 312      10
6193   10921  feature 172      55
57717   3229  feature 345       1

In [7]:
log_feature.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58671 entries, 0 to 58670
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           58671 non-null  int64
 1   log_feature  58671 non-null  object
 2   volume       58671 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.3+ MB

In [8]:
log_feature['log_feature'].replace('[^0-9.]','',inplace=True,regex=True)
log_feature.sample(5)

          id log_feature  volume
58021  14213         195       1
36932  10523         306       1
1712     375          82      76
33599  13030         312      86
20445  17030         233       1

In [9]:
resource_type=pd.read_csv('resource_type.csv')
resource_type.sample(5)

          id    resource_type
16300   8438  resource_type 8
14811  10905  resource_type 2
12098    645  resource_type 2
15362  17441  resource_type 8
4104    1834  resource_type 2

In [10]:
resource_type.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21076 entries, 0 to 21075
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21076 non-null  int64
 1   resource_type  21076 non-null  object
dtypes: int64(1), object(1)
memory usage: 329.4+ KB

In [11]:
resource_type['resource_type'].replace('[^0-9.]','',inplace=True,regex=True)
resource_type.sample(5)

          id resource_type
6110   11409             2
1464    5726             8
3816    2132             2
20237   5366             2
6244   12083             2

In [12]:
resource_type.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21076 entries, 0 to 21075
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21076 non-null  int64
 1   resource_type  21076 non-null  object
dtypes: int64(1), object(1)
memory usage: 329.4+ KB

In [13]:
severity_type=pd.read_csv('severity_type.csv')
severity_type.sample(5)

          id    severity_type
7869    9268  severity_type 2
5360    9458  severity_type 2
6626   18504  severity_type 2
10043   1441  severity_type 1
12536  16889  severity_type 1

In [14]:
severity_type['severity_type'].replace('[^0-9.]','',inplace=True,regex=True)
severity_type.sample(3)

         id severity_type
3730   6013             2
5701   9816             1
14052  2615             2

In [15]:
train=pd.read_csv('train.csv')
train.sample(5)

         id       location  fault_severity
4354     80   location 194               0
3980   5784  location 1019               2
2479  10364  location 1050               0
7337   3511   location 996               0
665    1086  location 1093               0

In [16]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7381 entries, 0 to 7380
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              7381 non-null   int64
 1   location        7381 non-null   object
 2   fault_severity  7381 non-null   int64
dtypes: int64(2), object(1)
memory usage: 173.1+ KB

In [17]:
train['location'].replace('[^0-9.]','',inplace=True,regex=True)
train.sample(5)

        id location  fault_severity
2640  2274     1034               0
5864  4056      961               1
6751  4959      607               0
7372  1628      224               1
4711  8678      619               1

In [18]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7381 entries, 0 to 7380
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              7381 non-null   int64
 1   location        7381 non-null   object
 2   fault_severity  7381 non-null   int64
dtypes: int64(2), object(1)
memory usage: 173.1+ KB

In [19]:
df=train.merge(event_type,on='id').merge(resource_type,on='id').merge(severity_type,on='id').merge(log_feature,on='id')
df.sample(5)

,id,location,fault_severity,event_type,resource_type,severity_type,log_feature,volume
29271,10956,102,0,35,2,2,307,1
17617,7685,494,0,34,2,2,232,127
26617,8025,126,0,34,2,2,307,1
19989,6882,122,0,35,2,2,313,4
12022,2827,300,0,20,2,1,219,1

In [20]:
df.isnull().sum()

id                0
location          0
fault_severity    0
event_type        0
resource_type     0
severity_type     0
log_feature       0
volume            0
dtype: int64

In [21]:
df.corr()

                      id  fault_severity    volume
id              1.000000       -0.045528 -0.003244
fault_severity -0.045528        1.000000 -0.027196
volume         -0.003244       -0.027196  1.000000

In [22]:
df.describe()

                 id  fault_severity        volume
count  61839.000000    61839.000000  61839.000000
mean    9104.379469        0.549168      8.390336
std     5387.274195        0.727701     22.902491
min        1.000000        0.000000      1.000000
25%     4353.000000        0.000000      1.000000
50%     8981.000000        0.000000      2.000000
75%    13664.000000        1.000000      6.000000
max    18550.000000        2.000000    877.000000

In [23]:
x,y=df.drop('fault_severity',axis=1),df[['fault_severity']]

In [24]:
x=pd.get_dummies(x,drop_first=True)

In [25]:
x.shape,y.shape

((61839, 1321), (61839, 1))

In [26]:
 x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=60)

In [27]:
from sklearn.ensemble import GradientBoostingClassifier
GBC=GradientBoostingClassifier()
GBC.fit(x_train,y_train)

GradientBoostingClassifier(ccp_alpha=0.0, criterion='friedman_mse', init=None,
                           learning_rate=0.1, loss='deviance', max_depth=3,
                           max_features=None, max_leaf_nodes=None,
                           min_impurity_decrease=0.0, min_impurity_split=None,
                           min_samples_leaf=1, min_samples_split=2,
                           min_weight_fraction_leaf=0.0, n_estimators=100,
                           n_iter_no_change=None, presort='deprecated',
                           random_state=None, subsample=1.0, tol=0.0001,
                           validation_fraction=0.1, verbose=0,
                           warm_start=False)

In [28]:
predict_gbc=GBC.predict_proba(x_test)

In [29]:
predict_gbc[:,:]

array([[0.15466966, 0.79889166, 0.04643868],
       [0.92518906, 0.05712102, 0.01768992],
       [0.57294904, 0.31156413, 0.11548683],
       ...,
       [0.47210007, 0.23501099, 0.29288894],
       [0.63545072, 0.19602108, 0.16852819],
       [0.63197711, 0.10394191, 0.26408098]])

In [30]:
result=pd.DataFrame({
    "id":x_test.id,
    "Predicted fault severity":y_test.fault_severity,
    "Prediction probility_0":predict_gbc[:,0],
    "Prediction probility_1":predict_gbc[:,1],
    "Prediction probility_2":predict_gbc[:,2]
})

In [31]:
result.sample(5)

,id,Predicted fault severity,Prediction probility_0,Prediction probility_1,Prediction probility_2
35076,11352,2,0.434626,0.396604,0.168770
37674,13088,1,0.451808,0.402967,0.145225
25987,2793,0,0.652424,0.150911,0.196665
59371,4289,0,0.787834,0.188912,0.023254
31203,9162,1,0.432199,0.438036,0.129765